# Задание 2. Создание модуля с функциями арифметики
# Создайте модуль arithmetic.py, который будет содержать 4 функции: сложение, вычитание, умножение и деление.
# Импортируйте модуль в другой файл Python и выполните каждую из функций с произвольными аргументами.

import arithmetic

#Примеры вызова функций модуля
print(arithmetic.sum(5, 10))
print(arithmetic.diff(10, 8))
print(arithmetic.prod(2, 2))
print(arithmetic.div(25, 5))